# Tugas Event #2 - Solving Real-World Problems with Data Science

2113181065 - Surya Harahap | Universitas Sangga Buana Bandung

- Tanggal Mulai  : 13 November 2020
- Sumber (Matakuliah Data Mining)

# Tahapan
Dataset berisi 5 kolom label yang terdapat berisi apakah sunspot akan mempengaruhi hujan dan melihat pada minggu keberapa saja yang mengalami anomali data dan sebagainya.

Pertama import library pandas dan mengubah file exel menjadi sebuah dataframe.

In [9]:
import pandas as pd

df = pd.read_excel('Surya.xlsx')

In [10]:
# menampilkan 5 baris teraras 
df.head()

   minggu ke  hujan sunspot      kosmik    soi         iod
0          1   6,67   61,17   1868203,5  10,27  -0,0351564
1          2  15,43   45,14     1785459   9,99   -0,312826
2          3   2,71   95,29     1842437  18,02   -0,502122
3          4   3,71   66,57  1826204,29  24,34   -0,158204
4          5   1,86   25,57  1851700,14   7,97    -0,26236

Selanjutnya, kita akan mengecek apakah terdapat nilai-nilai yang hilang pada dataset dan terdapat atribut yang bukan merupakan berisi bilangan numerik.

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 795 entries, 0 to 794
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   minggu ke  795 non-null    int64
 1   hujan      795 non-null    object
 2   sunspot    795 non-null    object
 3   kosmik     795 non-null    object
 4   soi        795 non-null    object
 5   iod        795 non-null    object
dtypes: int64(1), object(5)
memory usage: 37.4+ KB

Output dari fungsi info() menunjukkan bahwa semua atribut nilainya lengkap, dan juga nilai nilai dari setiap kolom memiliki tipe data int64 dan object.

Pada tahap ini data sudah bisa dipakai untuk pelatihan model

In [12]:
# memisahkan atribut pada dataset dan menyimpannya pada sebuah variabel
X = df[df.columns[:5]]

# memisahkan label pada dataset dan menyimpannya pada sebuah variabel
y = df['hujan']

In [ ]:
from sklearn.preprocessing import StandardScaler
 
# standarisasi nilai-nilai dari dataset
scaler = StandardScaler()
scaler.fit(X)
X = scaler.transform(X)

Masih tahap pembelajaran dan pengembangan kedepannya akan melakukan Pull Request